{"name":"Pratik C","headerTaglineOne":"Enter my World 💫","headerTaglineTwo":"I'm Pratik - nerdy developer ","headerTaglineThree":"and tech explorer","headerTaglineFour":" based in Bangalore, India.","showCursor":true,"showBlog":true,"darkMode":false,"showResume":true,"socials":[{"id":"1","title":"Primary GitHub","link":"https://github.com/CodeBunny09"},{"id":"369bb173-0dcd-4f96-9aa9-11259915d9e9","title":"Secondary GitHub","link":"https://github.com/BadLegend1609"},{"id":"f7185d61-a944-45f5-8497-e24589e4061b","title":"LinkedIn","link":"https://www.linkedin.com/in/pratik-c/"},{"id":"1dea184f-457d-4f85-9643-cc70f48f0d19","title":"Twitter","link":"https://twitter.com/pratik_2912"}],"projects":[{"id":"5700a17a-41ed-4594-93f6-edb1af48bb44","title":"Collatz Conjecture","description":"Dive into the mesmerizing world of number theory with this tool, a cutting-edge program that brings the famed Collatz Conjecture to life. Watch as numbers dance through an intricate sequence of steps, revealing the enigmatic patterns that lie beneath. With each iteration, the tool sheds light on the mysteries of number behavior, offering a captivating journey into the heart of mathematical exploration.","imageSrc":"https://images.unsplash.com/photo-1624117987059-f1b8c83edfaa?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1173&q=80","url":"https://github.com/CodeBunny09/Collatz-Conjecture"},{"id":"fba7f264-16aa-492a-8e61-50d107e9d7ce","title":"The Good Worm","description":"Presenting a minimalist marvel: a self-replicating program. This project showcases the elegance of self-replication in a digital environment, embodying the essence of autonomous reproduction within a compact codebase. Witness the power of simplicity as the program perpetuates itself, highlighting the beauty of self-sustaining computation.","imageSrc":"https://images.unsplash.com/photo-1668854195238-cb205000a3cf?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1632&q=80","url":"https://github.com/CodeBunny09/TheGoodWorm"},{"id":"374884d4-19cb-44e9-9c0e-9a526fba59a3","title":"LOL Me Daddy","description":"Embark on a laughter-filled journey with the LOL Me Daddy Android app. Featuring a single button interface, a world of humor unfolds at your fingertips. Click and be greeted by a cascade of side-splitting memes, each tap delivering a dose of comedic brilliance. Embrace the simplicity of entertainment as LOL Me Daddy turns moments into joyous memories, proving that a button can truly be the gateway to endless laughter.","imageSrc":"https://images.unsplash.com/photo-1518020382113-a7e8fc38eac9?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=717&q=80","url":"https://github.com/CodeBunny09/LOL-Me-Daddy"},{"id":"2c6dc1d0-ebe6-42c0-9151-2c77cbd7fa2b","title":"Chapter Analytics Tool for Students","description":"A dynamic project designed to unlock the depths of chapter analysis. Seamlessly generating captivating word clouds, this tool visually encapsulates the essence of each chapter's focal points. Witness the power of data visualization as this tool transforms textual complexity into elegant, insightful displays. Unveil hidden patterns and gain new perspectives, all through the artistry of word clouds.","imageSrc":"https://media.istockphoto.com/id/470446763/photo/coaching-word-cloud-shaped-as-a-person.jpg?s=2048x2048&w=is&k=20&c=xN-gmUzYu8xT_NkUSgJZi0NwQGVm6B8zuW2_IAzXB8M=","url":"https://github.com/CodeBunny09/chapter-analysis"},{"id":"b4b8d400-adb1-4cc4-994f-06ae9dd7fab8","title":"Tic Tac Toe","description":"Experience the timeless thrill of Tic-Tac-Toe reimagined in a dynamic digital playground with React-Tac-Toe. Immerse yourself in this captivating project that utilizes the power of React to bring the classic game to life.","imageSrc":"https://plus.unsplash.com/premium_photo-1671493286804-92cbe5ed1b6c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1074&q=80","url":"https://github.com/BadLegend1609/tic-tac-toe"},{"id":"41fedf0b-9d4d-4ee4-b7be-0a761386c724","title":"CLI Hangman","description":"Delve into the realm of wordplay and suspense with the Python Hangman CLI game. This captivating project blends coding finesse with linguistic challenges, allowing you to unravel hidden words letter by letter. Engage your intellect, test your vocabulary, and experience the thrill of deduction as you decipher words in a classic yet innovative text-based setting. Python Hangman CLI promises hours of captivating entertainment, merging coding prowess with linguistic intrigue.","imageSrc":"https://www.trainerbubble.com/wp-content/uploads/2015/09/Hangman_web-1024x682.jpg.webp","url":"https://github.com/BadLegend1609/python-hangman"}],"services":[{"id":"2","title":"Branding","description":"We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"4","title":"Web Development and Hosting Solutions","description":"Seamless web solutions, from design to hosting. Elevate your online presence with our expert development and reliable hosting"},{"id":"78eb397b-6ff1-41a8-ba03-ad8ee73fd13b","title":"IT Solutions","description":"Comprehensive IT solutions, empowering efficiency. Unlock innovation and streamline operations with our tailored technology expertise."}],"aboutpara":"Hey there! 🌟 I'm a tech enthusiast exploring diverse frontiers – from crafting sleek Django-React apps to diving into Web 3 mysteries. With a knack for Power Platform, embedded systems, and automations, I'm always learning and evolving. Technology's potential to transform lives captivates me endlessly. Let's embark on this exciting journey together! 🚀🤖","resume":{"tagline":"Techy Nerd","description":"I have delivered world-class user experiences to people by automating and minimizing tasks. Well-versed with React, Javascript, and most of the Web frameworks, good at data science and AI.","experiences":[{"id":"1","dates":"2020 - Present","type":"Personal Projects","position":"Student","bullets":"Created websites with MERN Stack, Used React-Django Framework, Developed basic android apps, Created automation bots, For all the projects, Please refer to my both GitHub accounts"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"June 2023 - August 2023","type":"Internship","position":"Automation Developer and IT Intern","bullets":"Designed Apps for automating manual forms and business flows, Built canvas app in power apps, Configured Dataverse connectors, Created Power Automate flows for business logic,  Aided in troubleshooting hardware and software issues, Built good connections"}],"education":{"universityName":"MVM College Of Arts, Science and Management","universityDate":"2021-2024","universityPara":"Studying Bachelors of Computer Application with Cybersecurity as advancement"},"languages":["Python","JavaScript","Java","BASH Shell","PowerShell","C","HTML","CSS","Embedded C","Motoko"],"frameworks":["Django","Express Js","Mongoose","React","Flask","Node Js","Matplotlib","Tensorflow"],"others":["Prompt Engineering","Google Dorks","Communication","Office 365","Critical thinking and problem solving","Time and work management"]}}